{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"dtype": "float32", "bias_constraint": null, "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "batch_input_shape": [null, 48, 48, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "kernel_size": [5, 5], "activity_regularizer": null, "padding": "valid", "use_bias": true, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [5, 5], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "units": 1024, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "units": 1024, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "softmax", "units": 7, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}], "name": "sequential_1"}, "backend": "tensorflow"}